/* automatically generated by rust-bindgen 0.70.1 */

pub const __GENTOO_NOT_FREESTANDING: u32 = 1;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_node {
    pub __rb_parent_color: ::std::os::raw::c_ulong,
    pub rb_right: *mut rb_node,
    pub rb_left: *mut rb_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rb_node"][::std::mem::size_of::<rb_node>() - 24usize];
    ["Alignment of rb_node"][::std::mem::align_of::<rb_node>() - 8usize];
    ["Offset of field: rb_node::__rb_parent_color"]
        [::std::mem::offset_of!(rb_node, __rb_parent_color) - 0usize];
    ["Offset of field: rb_node::rb_right"][::std::mem::offset_of!(rb_node, rb_right) - 8usize];
    ["Offset of field: rb_node::rb_left"][::std::mem::offset_of!(rb_node, rb_left) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_root {
    pub rb_node: *mut rb_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rb_root"][::std::mem::size_of::<rb_root>() - 8usize];
    ["Alignment of rb_root"][::std::mem::align_of::<rb_root>() - 8usize];
    ["Offset of field: rb_root::rb_node"][::std::mem::offset_of!(rb_root, rb_node) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_root_cached {
    pub rb_root: rb_root,
    pub rb_leftmost: *mut rb_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rb_root_cached"][::std::mem::size_of::<rb_root_cached>() - 16usize];
    ["Alignment of rb_root_cached"][::std::mem::align_of::<rb_root_cached>() - 8usize];
    ["Offset of field: rb_root_cached::rb_root"]
        [::std::mem::offset_of!(rb_root_cached, rb_root) - 0usize];
    ["Offset of field: rb_root_cached::rb_leftmost"]
        [::std::mem::offset_of!(rb_root_cached, rb_leftmost) - 8usize];
};
